/*
 Navicat Premium Data Transfer

 Source Server         : 权沐
 Source Server Type    : MySQL
 Source Server Version : 80200 (8.2.0)
 Source Host           : localhost:3306
 Source Schema         : campus-detection-warning-system

 Target Server Type    : MySQL
 Target Server Version : 80200 (8.2.0)
 File Encoding         : 65001

 Date: 24/05/2025 13:08:28
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for opinioninformation
-- ----------------------------
DROP TABLE IF EXISTS `opinioninformation`;
CREATE TABLE `opinioninformation`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `time` date NULL DEFAULT NULL,
  `place` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `event_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `course_event` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `handle_school` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `socialImpact` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `参考文献` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 520 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of opinioninformation
-- ----------------------------
INSERT INTO `opinioninformation` VALUES (1, '2024-03-01', '山东力明科技职院', '交通事故', '女研究生在支教过程中遇到交通事故，不幸去世', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (2, '2022-05-01', '大连理工大学', '校管事件', '一名学生在校管事件不幸重伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (3, '2022-09-01', '清华大学', '教学管理', '教师醉酒驾车送学生回家，途中发生教学管理，造成重伤死1伤', '教师被依法逮捕，学校领导被问责', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (4, '2022-06-01', '华南理工大学', '校管事件', '教师醉酒驾车送学生回家，途中发生校管事件，造成受伤死1伤', '学校澄清消息不实', '消息澄清后获得社会舆论支持', '#ref8');
INSERT INTO `opinioninformation` VALUES (5, '2022-07-01', '某高校', '教学管理', '女研究生在支教过程中遇到教学管理，不幸去世', '教师被依法逮捕，学校领导被问责', '事件凸显校园交通安全的重要性', '#ref8');
INSERT INTO `opinioninformation` VALUES (6, '2022-02-01', '华南理工大学', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '教师被依法逮捕，学校领导被问责', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (7, '2023-02-01', '某高校', '人身安全', '一名学生在人身安全不幸身亡，据称其生前曾表现出较大的心理压力', '校方表示将进一步加强管理', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (8, '2022-10-01', '大连理工大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '校方表示将进一步加强管理', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (9, '2024-02-01', '山东力明科技职院', '人身安全', '一名学生在人身安全不幸受伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (10, '2022-11-01', '某高校', '交通事故', '女研究生在支教过程中遇到交通事故，不幸去世', '学校表示哀悼，并协调家属处理善后', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (11, '2023-02-01', '某高校', '校管事件', '因疫情防控政策调整，学生不满，集体校管事件抗议', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (12, '2023-10-01', '某高校', '教学管理', '教师醉酒驾车送学生回家，途中发生教学管理，造成重伤死2伤', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (13, '2022-01-01', '华南理工大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '教师被依法逮捕，学校领导被问责', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (14, '2023-08-01', '大连理工大学', '校管事件', '一名学生在校管事件不幸重伤，据称其生前曾表现出较大的心理压力', '学校表示哀悼，并协调家属处理善后', '事件凸显校园交通安全的重要性', '#ref24');
INSERT INTO `opinioninformation` VALUES (15, '2023-09-01', '大连理工大学', '人身安全', '一名学生在人身安全不幸重伤，据称其生前曾表现出较大的心理压力', '教师被依法逮捕，学校领导被问责', '事件展示了校园疫情防控管理面临的挑战', '#ref24');
INSERT INTO `opinioninformation` VALUES (16, '2024-09-01', '山东力明科技职院', '校管事件', '一名学生在校管事件不幸身亡，据称其生前曾表现出较大的心理压力', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (17, '2023-07-01', '大连理工大学', '人身安全', '因疫情防控政策调整，学生不满，集体人身安全抗议', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件展示了校园疫情防控管理面临的挑战', '#ref8');
INSERT INTO `opinioninformation` VALUES (18, '2024-05-01', '华南理工大学', '教学管理', '教师醉酒驾车送学生回家，途中发生教学管理，造成重伤死0伤', '教师被依法逮捕，学校领导被问责', '事件凸显校园交通安全的重要性', '#ref24');
INSERT INTO `opinioninformation` VALUES (19, '2023-04-01', '华南理工大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件展示了校园疫情防控管理面临的挑战', '#ref8');
INSERT INTO `opinioninformation` VALUES (20, '2023-06-01', '某高校', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成身亡死1伤', '学校澄清消息不实', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (21, '2023-01-01', '某高校', '教学管理', '学校教学管理出现问题，导致学生教学管理集会', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref24');
INSERT INTO `opinioninformation` VALUES (22, '2022-09-01', '华南理工大学', '教学管理', '女研究生在支教过程中遇到教学管理，不幸去世', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (23, '2021-11-01', '华南理工大学', '交通事故', '学校教学管理出现问题，导致学生交通事故集会', '教师被依法逮捕，学校领导被问责', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (24, '2022-09-01', '大连理工大学', '人身安全', '因疫情防控政策调整，学生不满，集体人身安全抗议', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (25, '2023-10-01', '山东力明科技职院', '人身安全', '女研究生在支教过程中遇到人身安全，不幸去世', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件凸显校园交通安全的重要性', '#ref24');
INSERT INTO `opinioninformation` VALUES (26, '2023-11-01', '某高校', '人身安全', '因疫情防控政策调整，学生不满，集体人身安全抗议', '校方表示将进一步加强管理', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (27, '2024-05-01', '山东力明科技职院', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成身亡死0伤', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件凸显校园交通安全的重要性', '#ref8');
INSERT INTO `opinioninformation` VALUES (28, '2024-09-01', '某高校', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (29, '2024-03-01', '大连理工大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (30, '2023-08-01', '华南理工大学', '人身安全', '女研究生在支教过程中遇到人身安全，不幸去世', '校方表示将进一步加强管理', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (31, '2022-10-01', '某高校', '人身安全', '因疫情防控政策调整，学生不满，集体人身安全抗议', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (32, '2023-06-01', '清华大学', '校管事件', '因疫情防控政策调整，学生不满，集体校管事件抗议', '教师被依法逮捕，学校领导被问责', '事件展示了校园疫情防控管理面临的挑战', '#ref8');
INSERT INTO `opinioninformation` VALUES (33, '2022-04-01', '清华大学', '教学管理', '女研究生在支教过程中遇到教学管理，不幸去世', '学校表示哀悼，并协调家属处理善后', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (34, '2023-04-01', '清华大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '校方表示将进一步加强管理', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (35, '2024-05-01', '清华大学', '校管事件', '因疫情防控政策调整，学生不满，集体校管事件抗议', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (36, '2022-06-01', '某高校', '交通事故', '因疫情防控政策调整，学生不满，集体交通事故抗议', '学校表示哀悼，并协调家属处理善后', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (37, '2022-01-01', '大连理工大学', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '学校澄清消息不实', '事件凸显校园交通安全的重要性', '#ref24');
INSERT INTO `opinioninformation` VALUES (38, '2024-09-01', '某高校', '交通事故', '学校教学管理出现问题，导致学生交通事故集会', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (39, '2022-03-01', '某高校', '教学管理', '女研究生在支教过程中遇到教学管理，不幸去世', '校方表示将进一步加强管理', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (40, '2022-12-01', '大连理工大学', '人身安全', '一名学生在人身安全不幸身亡，据称其生前曾表现出较大的心理压力', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (41, '2022-01-01', '山东力明科技职院', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '校方表示将进一步加强管理', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (42, '2023-06-01', '华南理工大学', '交通事故', '女研究生在支教过程中遇到交通事故，不幸去世', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (43, '2022-05-01', '大连理工大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '消息澄清后获得社会舆论支持', '#ref24');
INSERT INTO `opinioninformation` VALUES (44, '2022-12-01', '清华大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '教师被依法逮捕，学校领导被问责', '事件引发对学生心理健康问题的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (45, '2022-05-01', '华南理工大学', '校管事件', '因疫情防控政策调整，学生不满，集体校管事件抗议', '校方表示将进一步加强管理', '消息澄清后获得社会舆论支持', '#ref8');
INSERT INTO `opinioninformation` VALUES (46, '2022-10-01', '华南理工大学', '校管事件', '一名学生在校管事件不幸重伤，据称其生前曾表现出较大的心理压力', '校方表示将进一步加强管理', '消息澄清后获得社会舆论支持', '#ref6');
INSERT INTO `opinioninformation` VALUES (47, '2023-12-01', '清华大学', '教学管理', '女研究生在支教过程中遇到教学管理，不幸去世', '学校表示哀悼，并协调家属处理善后', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (48, '2024-06-01', '某高校', '交通事故', '一名学生在交通事故不幸重伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (49, '2023-03-01', '某高校', '人身安全', '一名学生在人身安全不幸受伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (50, '2022-11-01', '华南理工大学', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成重伤死0伤', '教师被依法逮捕，学校领导被问责', '事件展示了校园疫情防控管理面临的挑战', '#ref8');
INSERT INTO `opinioninformation` VALUES (51, '2022-01-01', '某高校', '交通事故', '因疫情防控政策调整，学生不满，集体交通事故抗议', '校方表示将进一步加强管理', '消息澄清后获得社会舆论支持', '#ref8');
INSERT INTO `opinioninformation` VALUES (52, '2023-11-01', '大连理工大学', '人身安全', '一名学生在人身安全不幸受伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref24');
INSERT INTO `opinioninformation` VALUES (53, '2022-07-01', '华南理工大学', '人身安全', '一名学生在人身安全不幸受伤，据称其生前曾表现出较大的心理压力', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (54, '2022-11-01', '华南理工大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (55, '2021-12-01', '大连理工大学', '人身安全', '因疫情防控政策调整，学生不满，集体人身安全抗议', '学校澄清消息不实', '事件凸显校园交通安全的重要性', '#ref8');
INSERT INTO `opinioninformation` VALUES (56, '2022-03-01', '大连理工大学', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (57, '2023-09-01', '华南理工大学', '人身安全', '教师醉酒驾车送学生回家，途中发生人身安全，造成重伤死3伤', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '消息澄清后获得社会舆论支持', '#ref24');
INSERT INTO `opinioninformation` VALUES (58, '2023-01-01', '华南理工大学', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成受伤死3伤', '学校表示哀悼，并协调家属处理善后', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (59, '2023-09-01', '华南理工大学', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '教师被依法逮捕，学校领导被问责', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (60, '2024-09-01', '山东力明科技职院', '教学管理', '一名学生在教学管理不幸受伤，据称其生前曾表现出较大的心理压力', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (61, '2021-11-01', '清华大学', '人身安全', '教师醉酒驾车送学生回家，途中发生人身安全，造成重伤死3伤', '学校表示哀悼，并协调家属处理善后', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (62, '2024-07-01', '大连理工大学', '教学管理', '因疫情防控政策调整，学生不满，集体教学管理抗议', '学校表示哀悼，并协调家属处理善后', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (63, '2023-12-01', '大连理工大学', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成重伤死2伤', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (64, '2022-04-01', '某高校', '校管事件', '因疫情防控政策调整，学生不满，集体校管事件抗议', '教师被依法逮捕，学校领导被问责', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (65, '2022-10-01', '山东力明科技职院', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成身亡死0伤', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (66, '2022-04-01', '某高校', '校管事件', '教师醉酒驾车送学生回家，途中发生校管事件，造成受伤死1伤', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (67, '2023-05-01', '清华大学', '人身安全', '教师醉酒驾车送学生回家，途中发生人身安全，造成身亡死3伤', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (68, '2024-08-01', '山东力明科技职院', '人身安全', '一名学生在人身安全不幸重伤，据称其生前曾表现出较大的心理压力', '校方表示将进一步加强管理', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (69, '2022-02-01', '清华大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '学校表示哀悼，并协调家属处理善后', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (70, '2022-01-01', '清华大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref8');
INSERT INTO `opinioninformation` VALUES (71, '2022-01-01', '清华大学', '教学管理', '教师醉酒驾车送学生回家，途中发生教学管理，造成重伤死3伤', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (72, '2021-11-01', '某高校', '校管事件', '一名学生在校管事件不幸受伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (73, '2022-07-01', '华南理工大学', '校管事件', '一名学生在校管事件不幸受伤，据称其生前曾表现出较大的心理压力', '校方表示将进一步加强管理', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (74, '2024-04-01', '某高校', '交通事故', '因疫情防控政策调整，学生不满，集体交通事故抗议', '教师被依法逮捕，学校领导被问责', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (75, '2024-08-01', '清华大学', '交通事故', '因疫情防控政策调整，学生不满，集体交通事故抗议', '校方表示将进一步加强管理', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (76, '2022-08-01', '大连理工大学', '校管事件', '教师醉酒驾车送学生回家，途中发生校管事件，造成重伤死0伤', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (77, '2021-11-01', '清华大学', '教学管理', '学校教学管理出现问题，导致学生教学管理集会', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (78, '2023-03-01', '华南理工大学', '交通事故', '一名学生在交通事故不幸身亡，据称其生前曾表现出较大的心理压力', '学校表示哀悼，并协调家属处理善后', '事件凸显校园交通安全的重要性', '#ref8');
INSERT INTO `opinioninformation` VALUES (79, '2022-04-01', '华南理工大学', '教学管理', '因疫情防控政策调整，学生不满，集体教学管理抗议', '教师被依法逮捕，学校领导被问责', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (80, '2024-03-01', '山东力明科技职院', '教学管理', '教师醉酒驾车送学生回家，途中发生教学管理，造成受伤死1伤', '校方表示将进一步加强管理', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (81, '2023-05-01', '大连理工大学', '教学管理', '因疫情防控政策调整，学生不满，集体教学管理抗议', '学校表示哀悼，并协调家属处理善后', '事件凸显校园交通安全的重要性', '#ref8');
INSERT INTO `opinioninformation` VALUES (82, '2024-08-01', '大连理工大学', '人身安全', '一名学生在人身安全不幸重伤，据称其生前曾表现出较大的心理压力', '教师被依法逮捕，学校领导被问责', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (83, '2024-05-01', '华南理工大学', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref24');
INSERT INTO `opinioninformation` VALUES (84, '2023-09-01', '大连理工大学', '校管事件', '一名学生在校管事件不幸重伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (85, '2023-02-01', '山东力明科技职院', '人身安全', '教师醉酒驾车送学生回家，途中发生人身安全，造成重伤死3伤', '学校澄清消息不实', '事件凸显校园交通安全的重要性', '#ref8');
INSERT INTO `opinioninformation` VALUES (86, '2024-09-01', '华南理工大学', '教学管理', '一名学生在教学管理不幸重伤，据称其生前曾表现出较大的心理压力', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (87, '2024-03-01', '华南理工大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '校方表示将进一步加强管理', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (88, '2024-01-01', '大连理工大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '教师被依法逮捕，学校领导被问责', '事件展示了校园疫情防控管理面临的挑战', '#ref8');
INSERT INTO `opinioninformation` VALUES (89, '2024-04-01', '某高校', '教学管理', '因疫情防控政策调整，学生不满，集体教学管理抗议', '学校澄清消息不实', '事件展示了校园疫情防控管理面临的挑战', '#ref6');
INSERT INTO `opinioninformation` VALUES (90, '2023-07-01', '大连理工大学', '人身安全', '教师醉酒驾车送学生回家，途中发生人身安全，造成受伤死1伤', '学校表示哀悼，并协调家属处理善后', '事件引发对学生心理健康问题的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (91, '2024-01-01', '山东力明科技职院', '人身安全', '学校教学管理出现问题，导致学生人身安全集会', '教师被依法逮捕，学校领导被问责', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref8');
INSERT INTO `opinioninformation` VALUES (92, '2022-11-01', '山东力明科技职院', '人身安全', '因疫情防控政策调整，学生不满，集体人身安全抗议', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件引发对学生心理健康问题的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (93, '2023-02-01', '清华大学', '校管事件', '女研究生在支教过程中遇到校管事件，不幸去世', '学校表示哀悼，并协调家属处理善后', '事件展示了校园疫情防控管理面临的挑战', '#ref24');
INSERT INTO `opinioninformation` VALUES (94, '2022-08-01', '某高校', '教学管理', '一名学生在教学管理不幸受伤，据称其生前曾表现出较大的心理压力', '校方表示将进一步加强管理', '事件引发对学生心理健康问题的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (95, '2022-09-01', '华南理工大学', '交通事故', '教师醉酒驾车送学生回家，途中发生交通事故，造成身亡死3伤', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '事件引发对学生心理健康问题的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (96, '2024-08-01', '某高校', '校管事件', '一名学生在校管事件不幸身亡，据称其生前曾表现出较大的心理压力', '校方成立调查组，确认非他杀，呼吁关注学生心理健康', '消息澄清后获得社会舆论支持', '#ref24');
INSERT INTO `opinioninformation` VALUES (97, '2024-06-01', '大连理工大学', '交通事故', '因疫情防控政策调整，学生不满，集体交通事故抗议', '校方表示将进一步加强管理', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (98, '2024-07-01', '清华大学', '校管事件', '学校教学管理出现问题，导致学生校管事件集会', '校方表示将进一步加强管理', '事件凸显校园交通安全的重要性', '#ref6');
INSERT INTO `opinioninformation` VALUES (100, '2023-12-01', '华南理工大学', '教学管理', '女研究生在支教过程中遇到教学管理，不幸去世', '学校澄清消息不实', '事件提醒社会注意学生参与社会实践时的安全保障', '#ref6');
INSERT INTO `opinioninformation` VALUES (101, '2022-09-01', '清华大学', '教学管理', '因校园管理不善，学生频繁发生冲突', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (102, '2023-12-01', '清华大学', '人身安全', '因校园管理不善，学生频繁发生冲突', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (103, '2022-09-01', '华南理工大学', '交通事件', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (104, '2023-07-01', '某高校', '校管事件', '某实验室安全事件，导致校管事件人受伤', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (105, '2024-05-01', '某高校', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (106, '2024-01-01', '大连理工大学', '交通事件', '因校园管理不善，学生频繁发生冲突', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (107, '2022-01-01', '华南理工大学', '人身安全', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (108, '2024-08-01', '某高校', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (109, '2024-03-01', '华南理工大学', '交通事件', '某实验室安全事件，导致交通事件人受伤', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (110, '2023-01-01', '大连理工大学', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (111, '2023-01-01', '大连理工大学', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (112, '2024-07-01', '某高校', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (113, '2022-01-01', '清华大学', '人身安全', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (114, '2023-05-01', '大连理工大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (115, '2021-12-01', '华南理工大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (116, '2023-12-01', '某高校', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (117, '2022-12-01', '大连理工大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (118, '2023-02-01', '华南理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (119, '2024-01-01', '山东力明科技职院', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (120, '2021-11-01', '山东力明科技职院', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (121, '2022-03-01', '大连理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (122, '2023-07-01', '清华大学', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (123, '2022-01-01', '某高校', '交通事件', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (124, '2023-08-01', '某高校', '交通事件', '某实验室安全事件，导致交通事件人受伤', '事件未得到有效解决，学生继续投诉', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (125, '2024-09-01', '华南理工大学', '校管事件', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (126, '2023-12-01', '华南理工大学', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (127, '2024-10-01', '某高校', '教学管理', '某实验室安全事件，导致教学管理人受伤', '教师被停职调查，校方发表声明', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (128, '2022-03-01', '某高校', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (129, '2022-03-01', '山东力明科技职院', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (130, '2023-01-01', '华南理工大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (131, '2023-10-01', '山东力明科技职院', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (132, '2022-02-01', '清华大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (133, '2022-04-01', '山东力明科技职院', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (134, '2023-07-01', '清华大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (135, '2024-02-01', '清华大学', '交通事件', '某实验室安全事件，导致交通事件人受伤', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (136, '2023-12-01', '华南理工大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (137, '2023-05-01', '大连理工大学', '人身安全', '某实验室安全事件，导致人身安全人受伤', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (138, '2022-09-01', '大连理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (139, '2022-08-01', '华南理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (140, '2024-04-01', '华南理工大学', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (141, '2023-01-01', '清华大学', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (142, '2023-10-01', '华南理工大学', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (143, '2023-12-01', '山东力明科技职院', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (144, '2024-09-01', '某高校', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (145, '2023-05-01', '大连理工大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (146, '2022-06-01', '某高校', '教学管理', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (147, '2022-12-01', '大连理工大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (148, '2024-03-01', '大连理工大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (149, '2021-12-01', '华南理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (150, '2021-11-01', '某高校', '人身安全', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (151, '2023-12-01', '山东力明科技职院', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (152, '2021-12-01', '华南理工大学', '校管事件', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (153, '2021-12-01', '某高校', '教学管理', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (154, '2024-04-01', '山东力明科技职院', '人身安全', '某实验室安全事件，导致人身安全人受伤', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (155, '2023-07-01', '山东力明科技职院', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (156, '2023-10-01', '清华大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (157, '2022-09-01', '华南理工大学', '人身安全', '学生不满教学质量，集体投诉', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (158, '2021-12-01', '某高校', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '公众关注学生安全问题，引发讨论', '#ref8');
INSERT INTO `opinioninformation` VALUES (159, '2023-02-01', '大连理工大学', '校管事件', '校方未及时处理学生心理问题，导致事件恶化', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (160, '2022-12-01', '清华大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方低调处理，引发舆论关注', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (161, '2024-08-01', '大连理工大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (162, '2022-03-01', '大连理工大学', '人身安全', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (163, '2022-11-01', '某高校', '校管事件', '某实验室安全事件，导致校管事件人受伤', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (164, '2021-11-01', '大连理工大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (165, '2023-02-01', '清华大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (166, '2022-01-01', '华南理工大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (167, '2023-05-01', '某高校', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (168, '2023-10-01', '山东力明科技职院', '交通事件', '因校园管理不善，学生频繁发生冲突', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (169, '2023-09-01', '山东力明科技职院', '交通事件', '因校园管理不善，学生频繁发生冲突', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (170, '2023-07-01', '华南理工大学', '人身安全', '某实验室安全事件，导致人身安全人受伤', '教师被停职调查，校方发表声明', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (171, '2022-09-01', '山东力明科技职院', '交通事件', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (172, '2022-03-01', '大连理工大学', '交通事件', '学生不满教学质量，集体投诉', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (173, '2022-05-01', '山东力明科技职院', '教学管理', '某实验室安全事件，导致教学管理人受伤', '学校承诺改善管理，避免类似事件', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (174, '2023-11-01', '大连理工大学', '交通事件', '某实验室安全事件，导致交通事件人受伤', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (175, '2023-01-01', '山东力明科技职院', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (176, '2023-12-01', '山东力明科技职院', '交通事件', '某实验室安全事件，导致交通事件人受伤', '事件未得到有效解决，学生继续投诉', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (177, '2024-04-01', '华南理工大学', '人身安全', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (178, '2023-04-01', '某高校', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (179, '2023-03-01', '大连理工大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (180, '2023-02-01', '山东力明科技职院', '校管事件', '因校园管理不善，学生频繁发生冲突', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (181, '2022-06-01', '大连理工大学', '交通事件', '某实验室安全事件，导致交通事件人受伤', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (182, '2024-05-01', '华南理工大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (183, '2024-06-01', '华南理工大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (184, '2022-07-01', '华南理工大学', '教学管理', '因校园管理不善，学生频繁发生冲突', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (185, '2023-05-01', '清华大学', '人身安全', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (186, '2024-07-01', '清华大学', '人身安全', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (187, '2024-02-01', '大连理工大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (188, '2023-03-01', '山东力明科技职院', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (189, '2024-03-01', '华南理工大学', '教学管理', '因校园管理不善，学生频繁发生冲突', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (190, '2024-08-01', '山东力明科技职院', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (191, '2023-09-01', '山东力明科技职院', '教学管理', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (192, '2022-10-01', '华南理工大学', '交通事件', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (193, '2022-02-01', '某高校', '交通事件', '某实验室安全事件，导致交通事件人受伤', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (194, '2023-09-01', '清华大学', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (195, '2023-03-01', '大连理工大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (196, '2023-07-01', '某高校', '人身安全', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '公众关注学生安全问题，引发讨论', '#ref8');
INSERT INTO `opinioninformation` VALUES (197, '2023-02-01', '大连理工大学', '教学管理', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (198, '2024-08-01', '某高校', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (199, '2022-08-01', '山东力明科技职院', '教学管理', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (200, '2024-09-01', '华南理工大学', '人身安全', '教师被曝涉嫌不当行为，引发学生不满', '事件未得到有效解决，学生继续投诉', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (201, '2023-06-01', '大连理工大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (202, '2024-08-01', '华南理工大学', '人身安全', '某实验室安全事件，导致人身安全人受伤', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (203, '2022-02-01', '某高校', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (204, '2023-11-01', '华南理工大学', '校管事件', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (205, '2023-05-01', '山东力明科技职院', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (206, '2022-05-01', '某高校', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (207, '2023-12-01', '大连理工大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (208, '2024-04-01', '清华大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (209, '2023-05-01', '山东力明科技职院', '校管事件', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (210, '2022-10-01', '清华大学', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (211, '2023-10-01', '某高校', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref8');
INSERT INTO `opinioninformation` VALUES (212, '2024-07-01', '清华大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (213, '2024-08-01', '大连理工大学', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (214, '2024-09-01', '某高校', '教学管理', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (215, '2024-01-01', '山东力明科技职院', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (216, '2023-01-01', '某高校', '人身安全', '因校园管理不善，学生频繁发生冲突', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (217, '2021-12-01', '山东力明科技职院', '交通事件', '因校园管理不善，学生频繁发生冲突', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (218, '2022-09-01', '大连理工大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (219, '2024-06-01', '大连理工大学', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (220, '2023-03-01', '清华大学', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (221, '2023-10-01', '清华大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (222, '2023-05-01', '清华大学', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (223, '2022-11-01', '大连理工大学', '教学管理', '学生不满教学质量，集体投诉', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (224, '2023-02-01', '清华大学', '人身安全', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (225, '2024-10-01', '某高校', '交通事件', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '引发对高校心理健康保障的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (226, '2024-10-01', '某高校', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (227, '2022-10-01', '华南理工大学', '人身安全', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (228, '2023-03-01', '大连理工大学', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (229, '2022-05-01', '清华大学', '人身安全', '因校园管理不善，学生频繁发生冲突', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (230, '2022-06-01', '清华大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (231, '2024-03-01', '某高校', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (232, '2023-09-01', '清华大学', '人身安全', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (233, '2023-04-01', '山东力明科技职院', '交通事件', '某实验室安全事件，导致交通事件人受伤', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (234, '2024-08-01', '清华大学', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref8');
INSERT INTO `opinioninformation` VALUES (235, '2022-03-01', '某高校', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (236, '2024-09-01', '山东力明科技职院', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (237, '2023-03-01', '清华大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (238, '2023-05-01', '华南理工大学', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (239, '2022-07-01', '大连理工大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (240, '2023-02-01', '清华大学', '交通事件', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (241, '2022-10-01', '山东力明科技职院', '教学管理', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref8');
INSERT INTO `opinioninformation` VALUES (242, '2023-02-01', '大连理工大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (243, '2024-08-01', '华南理工大学', '教学管理', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref8');
INSERT INTO `opinioninformation` VALUES (244, '2024-10-01', '华南理工大学', '校管事件', '一名学生在校管事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (245, '2024-07-01', '华南理工大学', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (246, '2023-04-01', '山东力明科技职院', '校管事件', '某实验室安全事件，导致校管事件人受伤', '事件未得到有效解决，学生继续投诉', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (247, '2023-11-01', '大连理工大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '校方低调处理，引发舆论关注', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (248, '2023-03-01', '清华大学', '教学管理', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (249, '2024-08-01', '清华大学', '校管事件', '因校园管理不善，学生频繁发生冲突', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (250, '2022-02-01', '山东力明科技职院', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (251, '2022-07-01', '某高校', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (252, '2023-11-01', '华南理工大学', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (253, '2023-06-01', '清华大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (254, '2023-08-01', '大连理工大学', '校管事件', '学生不满教学质量，集体投诉', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (255, '2024-03-01', '清华大学', '交通事件', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (256, '2023-12-01', '大连理工大学', '校管事件', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (257, '2022-02-01', '大连理工大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (258, '2023-02-01', '华南理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (259, '2022-11-01', '山东力明科技职院', '交通事件', '某实验室安全事件，导致交通事件人受伤', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (260, '2022-08-01', '华南理工大学', '教学管理', '教师被曝涉嫌不当行为，引发学生不满', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (261, '2023-02-01', '某高校', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (262, '2022-03-01', '大连理工大学', '教学管理', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (263, '2024-10-01', '山东力明科技职院', '人身安全', '因校园管理不善，学生频繁发生冲突', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (264, '2022-09-01', '清华大学', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (265, '2021-12-01', '某高校', '教学管理', '某实验室安全事件，导致教学管理人受伤', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (266, '2024-07-01', '大连理工大学', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (267, '2023-04-01', '某高校', '教学管理', '某实验室安全事件，导致教学管理人受伤', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (268, '2021-11-01', '华南理工大学', '交通事件', '一名学生在交通事件发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (269, '2021-12-01', '某高校', '人身安全', '某实验室安全事件，导致人身安全人受伤', '事件未得到有效解决，学生继续投诉', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (270, '2024-06-01', '清华大学', '交通事件', '因校园管理不善，学生频繁发生冲突', '教师被停职调查，校方发表声明', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (271, '2022-11-01', '清华大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (272, '2024-07-01', '清华大学', '教学管理', '因校园管理不善，学生频繁发生冲突', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (273, '2022-09-01', '大连理工大学', '交通事件', '教师被曝涉嫌不当行为，引发学生不满', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (274, '2023-04-01', '华南理工大学', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '学校承诺改善管理，避免类似事件', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (275, '2023-05-01', '某高校', '人身安全', '学生不满教学质量，集体投诉', '教师被停职调查，校方发表声明', '舆论批评校方管理不善', '#ref8');
INSERT INTO `opinioninformation` VALUES (276, '2022-03-01', '山东力明科技职院', '交通事件', '学生不满教学质量，集体投诉', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (277, '2023-01-01', '某高校', '教学管理', '因校园管理不善，学生频繁发生冲突', '校方低调处理，引发舆论关注', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (278, '2022-08-01', '大连理工大学', '人身安全', '某实验室安全事件，导致人身安全人受伤', '事件未得到有效解决，学生继续投诉', '公众关注学生安全问题，引发讨论', '#ref6');
INSERT INTO `opinioninformation` VALUES (279, '2023-08-01', '山东力明科技职院', '教学管理', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (280, '2022-12-01', '清华大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref8');
INSERT INTO `opinioninformation` VALUES (281, '2024-06-01', '华南理工大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (282, '2022-08-01', '清华大学', '交通事件', '因校园管理不善，学生频繁发生冲突', '事件未得到有效解决，学生继续投诉', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (283, '2022-01-01', '清华大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方低调处理，引发舆论关注', '事件引起媒体广泛报道，影响校誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (284, '2022-03-01', '华南理工大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '校方被责令改进，事件处理缓慢引发不满', '引发对高校心理健康保障的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (285, '2022-11-01', '清华大学', '人身安全', '学生不满教学质量，集体投诉', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (286, '2024-01-01', '某高校', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '事件引起媒体广泛报道，影响校誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (287, '2023-03-01', '清华大学', '校管事件', '某实验室安全事件，导致校管事件人受伤', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (288, '2024-01-01', '大连理工大学', '交通事件', '学生不满教学质量，集体投诉', '学校承诺改善管理，避免类似事件', '公众关注学生安全问题，引发讨论', '#ref24');
INSERT INTO `opinioninformation` VALUES (289, '2023-12-01', '清华大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '舆论批评校方管理不善', '#ref24');
INSERT INTO `opinioninformation` VALUES (290, '2024-01-01', '清华大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '校方低调处理，引发舆论关注', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (291, '2022-10-01', '大连理工大学', '人身安全', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (292, '2024-10-01', '某高校', '交通事件', '学生不满教学质量，集体投诉', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (293, '2023-10-01', '清华大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (294, '2023-06-01', '华南理工大学', '教学管理', '某实验室安全事件，导致教学管理人受伤', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref24');
INSERT INTO `opinioninformation` VALUES (295, '2023-12-01', '某高校', '交通事件', '校方未及时处理学生心理问题，导致事件恶化', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (296, '2021-11-01', '大连理工大学', '校管事件', '教师被曝涉嫌不当行为，引发学生不满', '校方低调处理，引发舆论关注', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (297, '2024-09-01', '清华大学', '教学管理', '一名学生在教学管理发生意外，造成心理压力过大', '教师被停职调查，校方发表声明', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (298, '2023-12-01', '华南理工大学', '教学管理', '校方未及时处理学生心理问题，导致事件恶化', '事件未得到有效解决，学生继续投诉', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (299, '2024-07-01', '华南理工大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '学校承诺改善管理，避免类似事件', '事件引发社会对高校管理的质疑', '#ref6');
INSERT INTO `opinioninformation` VALUES (300, '2023-09-01', '华南理工大学', '人身安全', '一名学生在人身安全发生意外，造成心理压力过大', '校方被责令改进，事件处理缓慢引发不满', '舆论批评校方管理不善', '#ref6');
INSERT INTO `opinioninformation` VALUES (301, '2022-01-01', '清华大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (302, '2022-11-01', '某高校', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (303, '2023-07-01', '某高校', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (304, '2024-09-01', '山东力明科技职院', '校管事件', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (305, '2024-01-01', '大连理工大学', '人身安全', '学校组织师生互动活动，增进师生关系', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (306, '2023-10-01', '华南理工大学', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (307, '2022-10-01', '某高校', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (308, '2022-03-01', '某高校', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (309, '2023-09-01', '山东力明科技职院', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (310, '2024-04-01', '山东力明科技职院', '校管事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (311, '2024-05-01', '山东力明科技职院', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (312, '2023-04-01', '华南理工大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (313, '2024-04-01', '某高校', '交通事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (314, '2023-03-01', '华南理工大学', '教学管理', '学校组织师生互动活动，增进师生关系', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (315, '2023-02-01', '华南理工大学', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (316, '2022-06-01', '华南理工大学', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (317, '2023-03-01', '清华大学', '人身安全', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (318, '2023-09-01', '清华大学', '教学管理', '校方改进教学管理，学生满意度提升', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (319, '2022-05-01', '华南理工大学', '人身安全', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (320, '2022-09-01', '清华大学', '教学管理', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (321, '2023-02-01', '山东力明科技职院', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (322, '2022-06-01', '华南理工大学', '教学管理', '学校组织师生互动活动，增进师生关系', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (323, '2022-07-01', '某高校', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (324, '2022-02-01', '某高校', '教学管理', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (325, '2023-08-01', '华南理工大学', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (326, '2023-09-01', '大连理工大学', '交通事件', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (327, '2022-12-01', '山东力明科技职院', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (328, '2022-02-01', '大连理工大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (329, '2022-07-01', '大连理工大学', '校管事件', '校方改进教学管理，学生满意度提升', '学校开展心理健康讲座，效果显著', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (330, '2022-02-01', '某高校', '人身安全', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (331, '2024-03-01', '华南理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (332, '2024-05-01', '山东力明科技职院', '教学管理', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (333, '2023-11-01', '清华大学', '教学管理', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref8');
INSERT INTO `opinioninformation` VALUES (334, '2022-10-01', '山东力明科技职院', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (335, '2024-01-01', '山东力明科技职院', '人身安全', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (336, '2022-11-01', '华南理工大学', '交通事件', '学校积极推进校园安全管理，获得家长赞誉', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (337, '2022-08-01', '大连理工大学', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (338, '2023-08-01', '山东力明科技职院', '交通事件', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (339, '2024-10-01', '山东力明科技职院', '交通事件', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (340, '2022-09-01', '华南理工大学', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (341, '2022-04-01', '山东力明科技职院', '人身安全', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (342, '2024-10-01', '华南理工大学', '人身安全', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (343, '2022-12-01', '某高校', '人身安全', '大学新建心理健康中心，学生反应积极', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (344, '2022-09-01', '清华大学', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (345, '2023-02-01', '大连理工大学', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (346, '2022-07-01', '某高校', '教学管理', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (347, '2022-07-01', '山东力明科技职院', '教学管理', '大学新建心理健康中心，学生反应积极', '校方公开感谢学生反馈，并表扬积极参与', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (348, '2024-03-01', '大连理工大学', '人身安全', '大学新建心理健康中心，学生反应积极', '学校积极响应，提供全面帮助', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (349, '2023-07-01', '华南理工大学', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (350, '2022-07-01', '清华大学', '校管事件', '大学新建心理健康中心，学生反应积极', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (351, '2024-06-01', '清华大学', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (352, '2023-11-01', '清华大学', '教学管理', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (353, '2023-01-01', '大连理工大学', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (354, '2023-12-01', '某高校', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (355, '2024-01-01', '华南理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (356, '2022-04-01', '华南理工大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (357, '2023-01-01', '华南理工大学', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (358, '2022-05-01', '大连理工大学', '交通事件', '大学新建心理健康中心，学生反应积极', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (359, '2022-02-01', '大连理工大学', '人身安全', '学校组织师生互动活动，增进师生关系', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (360, '2024-07-01', '某高校', '教学管理', '学校积极推进校园安全管理，获得家长赞誉', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (361, '2023-12-01', '华南理工大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (362, '2022-08-01', '山东力明科技职院', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (363, '2022-01-01', '山东力明科技职院', '交通事件', '大学新建心理健康中心，学生反应积极', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (364, '2023-11-01', '华南理工大学', '校管事件', '大学新建心理健康中心，学生反应积极', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (365, '2024-01-01', '大连理工大学', '人身安全', '学校组织师生互动活动，增进师生关系', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (366, '2024-04-01', '大连理工大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (367, '2024-08-01', '大连理工大学', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (368, '2023-07-01', '华南理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (369, '2024-02-01', '清华大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (370, '2022-06-01', '山东力明科技职院', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (371, '2023-09-01', '华南理工大学', '教学管理', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (372, '2022-02-01', '华南理工大学', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (373, '2024-03-01', '华南理工大学', '教学管理', '大学新建心理健康中心，学生反应积极', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (374, '2021-12-01', '山东力明科技职院', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (375, '2023-04-01', '清华大学', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开感谢学生反馈，并表扬积极参与', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (376, '2022-06-01', '大连理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (377, '2024-07-01', '清华大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (378, '2023-06-01', '清华大学', '交通事件', '大学新建心理健康中心，学生反应积极', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (379, '2022-05-01', '某高校', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (380, '2024-03-01', '清华大学', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (381, '2022-10-01', '清华大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (382, '2022-08-01', '清华大学', '校管事件', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref8');
INSERT INTO `opinioninformation` VALUES (383, '2023-11-01', '山东力明科技职院', '校管事件', '大学新建心理健康中心，学生反应积极', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (384, '2023-07-01', '清华大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (385, '2022-07-01', '某高校', '交通事件', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (386, '2023-01-01', '清华大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (387, '2023-07-01', '大连理工大学', '交通事件', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (388, '2024-02-01', '山东力明科技职院', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (389, '2022-08-01', '某高校', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (390, '2024-11-01', '大连理工大学', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (391, '2024-04-01', '大连理工大学', '教学管理', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (392, '2024-07-01', '山东力明科技职院', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (393, '2023-02-01', '山东力明科技职院', '人身安全', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (394, '2023-10-01', '清华大学', '教学管理', '学校组织师生互动活动，增进师生关系', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (395, '2023-10-01', '山东力明科技职院', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (396, '2024-06-01', '清华大学', '校管事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (397, '2024-06-01', '大连理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (398, '2022-03-01', '大连理工大学', '交通事件', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (399, '2024-06-01', '华南理工大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学校积极响应，提供全面帮助', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (400, '2024-09-01', '大连理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (401, '2023-05-01', '大连理工大学', '交通事件', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (402, '2023-03-01', '大连理工大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (403, '2024-05-01', '华南理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (404, '2024-08-01', '大连理工大学', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (405, '2024-10-01', '华南理工大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (406, '2023-09-01', '某高校', '交通事件', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (407, '2023-03-01', '清华大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (408, '2023-07-01', '华南理工大学', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (409, '2021-12-01', '某高校', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (410, '2023-09-01', '清华大学', '校管事件', '学校组织师生互动活动，增进师生关系', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (411, '2024-08-01', '某高校', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (412, '2023-08-01', '华南理工大学', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (413, '2022-12-01', '华南理工大学', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (414, '2023-03-01', '大连理工大学', '教学管理', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (415, '2023-06-01', '华南理工大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (416, '2022-01-01', '山东力明科技职院', '交通事件', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (417, '2021-12-01', '华南理工大学', '教学管理', '学校积极推进校园安全管理，获得家长赞誉', '校方公开承诺继续加强管理，获赞', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (418, '2021-12-01', '大连理工大学', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (419, '2024-01-01', '大连理工大学', '校管事件', '学校组织师生互动活动，增进师生关系', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (420, '2023-12-01', '某高校', '校管事件', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (421, '2023-08-01', '某高校', '交通事件', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (422, '2023-01-01', '大连理工大学', '教学管理', '大学新建心理健康中心，学生反应积极', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (423, '2024-07-01', '清华大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (424, '2023-11-01', '山东力明科技职院', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (425, '2023-02-01', '某高校', '交通事件', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (426, '2022-06-01', '某高校', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (427, '2024-03-01', '大连理工大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (428, '2024-01-01', '大连理工大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (429, '2024-06-01', '大连理工大学', '人身安全', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (430, '2024-02-01', '某高校', '校管事件', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (431, '2024-04-01', '华南理工大学', '交通事件', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (432, '2023-12-01', '清华大学', '交通事件', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (433, '2023-11-01', '某高校', '交通事件', '大学新建心理健康中心，学生反应积极', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (434, '2024-05-01', '某高校', '教学管理', '学校组织师生互动活动，增进师生关系', '校方公开感谢学生反馈，并表扬积极参与', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (435, '2022-11-01', '清华大学', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (436, '2023-01-01', '某高校', '校管事件', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref8');
INSERT INTO `opinioninformation` VALUES (437, '2024-06-01', '山东力明科技职院', '人身安全', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (438, '2022-07-01', '山东力明科技职院', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (439, '2023-05-01', '清华大学', '校管事件', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (440, '2022-11-01', '某高校', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (441, '2024-01-01', '山东力明科技职院', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (442, '2023-12-01', '某高校', '教学管理', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (443, '2023-10-01', '山东力明科技职院', '人身安全', '校方改进教学管理，学生满意度提升', '校方公开承诺继续加强管理，获赞', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (444, '2024-09-01', '大连理工大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (445, '2022-11-01', '某高校', '人身安全', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (446, '2022-07-01', '某高校', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (447, '2023-05-01', '山东力明科技职院', '交通事件', '大学新建心理健康中心，学生反应积极', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (448, '2023-04-01', '山东力明科技职院', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (449, '2024-04-01', '大连理工大学', '校管事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (450, '2021-12-01', '某高校', '交通事件', '学校组织师生互动活动，增进师生关系', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (451, '2023-12-01', '华南理工大学', '教学管理', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (452, '2022-08-01', '某高校', '人身安全', '校方改进教学管理，学生满意度提升', '学校开展心理健康讲座，效果显著', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (453, '2022-07-01', '某高校', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (454, '2023-03-01', '大连理工大学', '人身安全', '学校举办交通安全讲座，提升学生安全意识', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (455, '2024-11-01', '某高校', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (456, '2024-01-01', '山东力明科技职院', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '校方公开承诺继续加强管理，获赞', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (457, '2022-09-01', '某高校', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (458, '2023-06-01', '某高校', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (459, '2022-08-01', '某高校', '校管事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref8');
INSERT INTO `opinioninformation` VALUES (460, '2022-12-01', '山东力明科技职院', '校管事件', '校方改进教学管理，学生满意度提升', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (461, '2023-10-01', '山东力明科技职院', '教学管理', '学校组织师生互动活动，增进师生关系', '学校积极响应，提供全面帮助', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (462, '2024-01-01', '华南理工大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (463, '2022-10-01', '山东力明科技职院', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (464, '2023-11-01', '某高校', '人身安全', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (465, '2024-10-01', '华南理工大学', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (466, '2023-06-01', '华南理工大学', '交通事件', '学校积极推进校园安全管理，获得家长赞誉', '学生对校方的关怀表示感谢', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (467, '2022-07-01', '华南理工大学', '校管事件', '校方改进教学管理，学生满意度提升', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (468, '2024-10-01', '山东力明科技职院', '人身安全', '大学新建心理健康中心，学生反应积极', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref8');
INSERT INTO `opinioninformation` VALUES (469, '2023-04-01', '大连理工大学', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (470, '2022-01-01', '华南理工大学', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (471, '2024-09-01', '清华大学', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (472, '2023-02-01', '华南理工大学', '交通事件', '学校积极推进校园安全管理，获得家长赞誉', '学校积极响应，提供全面帮助', '事件获得家长和学生的好评', '#ref8');
INSERT INTO `opinioninformation` VALUES (473, '2024-07-01', '大连理工大学', '教学管理', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref8');
INSERT INTO `opinioninformation` VALUES (474, '2021-12-01', '清华大学', '教学管理', '学校举办交通安全讲座，提升学生安全意识', '学校开展心理健康讲座，效果显著', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (475, '2023-11-01', '华南理工大学', '交通事件', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (476, '2023-06-01', '华南理工大学', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref8');
INSERT INTO `opinioninformation` VALUES (477, '2021-11-01', '清华大学', '校管事件', '学校组织师生互动活动，增进师生关系', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (478, '2024-06-01', '清华大学', '教学管理', '大学新建心理健康中心，学生反应积极', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref8');
INSERT INTO `opinioninformation` VALUES (479, '2024-09-01', '山东力明科技职院', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (480, '2023-01-01', '清华大学', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '学生对校方的关怀表示感谢', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (481, '2023-09-01', '大连理工大学', '交通事件', '大学新建心理健康中心，学生反应积极', '学校开展心理健康讲座，效果显著', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (482, '2024-03-01', '华南理工大学', '人身安全', '学校组织师生互动活动，增进师生关系', '学生对校方的关怀表示感谢', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (483, '2023-03-01', '大连理工大学', '校管事件', '校方改进教学管理，学生满意度提升', '学校开展心理健康讲座，效果显著', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (484, '2024-10-01', '华南理工大学', '人身安全', '校方改进教学管理，学生满意度提升', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref6');
INSERT INTO `opinioninformation` VALUES (485, '2024-09-01', '山东力明科技职院', '人身安全', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (486, '2023-08-01', '山东力明科技职院', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (487, '2023-06-01', '山东力明科技职院', '人身安全', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (488, '2024-09-01', '华南理工大学', '交通事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref24');
INSERT INTO `opinioninformation` VALUES (489, '2023-02-01', '清华大学', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '校方公开感谢学生反馈，并表扬积极参与', '提高了学校的整体声誉', '#ref24');
INSERT INTO `opinioninformation` VALUES (490, '2022-08-01', '山东力明科技职院', '人身安全', '校方改进教学管理，学生满意度提升', '学生对校方的关怀表示感谢', '该事件促进了社会对学生心理健康的关注', '#ref6');
INSERT INTO `opinioninformation` VALUES (491, '2022-10-01', '某高校', '校管事件', '校方为学生提供心理辅导服务，有效减少压力', '校方公开承诺继续加强管理，获赞', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (492, '2022-10-01', '某高校', '校管事件', '大学新建心理健康中心，学生反应积极', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref24');
INSERT INTO `opinioninformation` VALUES (493, '2022-05-01', '大连理工大学', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '学生对校方的关怀表示感谢', '学生和家长对学校安全保障更有信心', '#ref6');
INSERT INTO `opinioninformation` VALUES (494, '2023-01-01', '山东力明科技职院', '校管事件', '学校举办交通安全讲座，提升学生安全意识', '校方公开承诺继续加强管理，获赞', '学生和家长对学校安全保障更有信心', '#ref24');
INSERT INTO `opinioninformation` VALUES (495, '2022-05-01', '清华大学', '交通事件', '学校组织师生互动活动，增进师生关系', '校方公开承诺继续加强管理，获赞', '事件获得家长和学生的好评', '#ref6');
INSERT INTO `opinioninformation` VALUES (496, '2022-05-01', '清华大学', '教学管理', '校方为学生提供心理辅导服务，有效减少压力', '校方公开感谢学生反馈，并表扬积极参与', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (497, '2024-09-01', '华南理工大学', '教学管理', '学校组织师生互动活动，增进师生关系', '校方公开感谢学生反馈，并表扬积极参与', '校方措施得到了社会广泛认可', '#ref6');
INSERT INTO `opinioninformation` VALUES (498, '2021-12-01', '清华大学', '交通事件', '学校举办交通安全讲座，提升学生安全意识', '学校积极响应，提供全面帮助', '该事件促进了社会对学生心理健康的关注', '#ref24');
INSERT INTO `opinioninformation` VALUES (499, '2022-02-01', '大连理工大学', '校管事件', '学校积极推进校园安全管理，获得家长赞誉', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref8');
INSERT INTO `opinioninformation` VALUES (500, '2024-08-01', '山东力明科技职院', '交通事件', '学校组织师生互动活动，增进师生关系', '学校开展心理健康讲座，效果显著', '事件获得家长和学生的好评', '#ref24');

-- ----------------------------
-- Table structure for schoolopinion
-- ----------------------------
DROP TABLE IF EXISTS `schoolopinion`;
CREATE TABLE `schoolopinion`  (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `info_attr` int NULL DEFAULT NULL COMMENT '1为正面2为负面其余为中性',
  `title` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '信息标题',
  `content` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '内容',
  `time` datetime NULL DEFAULT NULL COMMENT '文章的发布时间',
  `word` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '敏感词只有为负面情绪时出现',
  `issuer` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '发布人',
  `region` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '发布地区',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of schoolopinion
-- ----------------------------
INSERT INTO `schoolopinion` VALUES (1, 1, '誓言代替谎言#小狗日记', '誓言代替谎言#小狗日记天津市天津理工大学中环信息学院', '2024-11-03 15:48:03', NULL, '李四', '天津');
INSERT INTO `schoolopinion` VALUES (2, 0, '消极的新闻', '悲观不自信', '2024-11-03 15:49:11', '悲观', '王五', '天津');

-- ----------------------------
-- Table structure for studentmessage
-- ----------------------------
DROP TABLE IF EXISTS `studentmessage`;
CREATE TABLE `studentmessage`  (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'id主键',
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '学生姓名',
  `major` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '专业',
  `grade` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '年纪',
  `sex` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NULL DEFAULT NULL COMMENT '性别',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 48 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of studentmessage
-- ----------------------------
INSERT INTO `studentmessage` VALUES (1, '易凯', '土木工程', '大四', '男');
INSERT INTO `studentmessage` VALUES (2, '钱二筒', '化学工程与工艺', '大一', '男');
INSERT INTO `studentmessage` VALUES (3, '李四', '英语', '大一', '男');
INSERT INTO `studentmessage` VALUES (4, '易沐阳', '计算机科学与技术', '大四', '男');
INSERT INTO `studentmessage` VALUES (5, '黄涛', '电子信息工程', '大二', '男');
INSERT INTO `studentmessage` VALUES (6, '黄雷', '自动化', '大二', '男');
INSERT INTO `studentmessage` VALUES (7, '徐枫', '化学工程与工艺', '大四', '男');
INSERT INTO `studentmessage` VALUES (8, '张文凯', '英语', '大四', '男');
INSERT INTO `studentmessage` VALUES (9, '徐泓泓', '化学工程与工艺', '大二', '男');
INSERT INTO `studentmessage` VALUES (10, '赵玮', '数学与应用数学', '大四', '男');
INSERT INTO `studentmessage` VALUES (11, '孙绍竑', '英语', '大一', '男');
INSERT INTO `studentmessage` VALUES (12, '周润发', '自动化', '大一', '男');
INSERT INTO `studentmessage` VALUES (13, '周不易', '土木工程', '大四', '男');
INSERT INTO `studentmessage` VALUES (14, '吴广仁', '英语', '大二', '男');
INSERT INTO `studentmessage` VALUES (15, '郑锐明', '材料科学与工程', '大四', '男');
INSERT INTO `studentmessage` VALUES (16, '周冰冰', '自动化', '大三', '男');
INSERT INTO `studentmessage` VALUES (17, '王倩兮', '计算机科学与技术', '大一', '女');
INSERT INTO `studentmessage` VALUES (18, '李安然', '数学与应用数学', '大三', '女');
INSERT INTO `studentmessage` VALUES (19, '李沐枫', '英语', '大三', '男');
INSERT INTO `studentmessage` VALUES (20, '韩刘雪', '电子信息工程', '大二', '女');
INSERT INTO `studentmessage` VALUES (21, '刘川枫', '计算机科学与技术', '大二', '男');
INSERT INTO `studentmessage` VALUES (22, '严莉莉', '材料科学与工程', '大二', '女');
INSERT INTO `studentmessage` VALUES (23, '严蕊', '材料科学与工程', '大四', '女');
INSERT INTO `studentmessage` VALUES (24, '高风', '化学工程与工艺', '大三', '女');
INSERT INTO `studentmessage` VALUES (25, '张亮', '计算机科学与技术', '大三', '男');
INSERT INTO `studentmessage` VALUES (26, '周树人', '软件工程', '大四', '男');
INSERT INTO `studentmessage` VALUES (27, '欧阳浅', '化学工程与工艺', '大一', '男');
INSERT INTO `studentmessage` VALUES (28, '许飞', '材料科学与工程', '大三', '男');
INSERT INTO `studentmessage` VALUES (29, '崔文明', '化学工程与工艺', '大一', '男');
INSERT INTO `studentmessage` VALUES (30, '邓海明', '土木工程', '大四', '男');
INSERT INTO `studentmessage` VALUES (31, '蒋小鱼', '计算机科学与技术', '大四', '男');
INSERT INTO `studentmessage` VALUES (32, '胡图图', '计算机科学与技术', '大四', '男');
INSERT INTO `studentmessage` VALUES (33, '李加帅', '电子信息工程', '大二', '男');
INSERT INTO `studentmessage` VALUES (34, '宋益桐', '自动化', '大三', '女');
INSERT INTO `studentmessage` VALUES (35, '唐宋元', '自动化', '大二', '男');
INSERT INTO `studentmessage` VALUES (36, '唐糖', '自动化', '大四', '女');
INSERT INTO `studentmessage` VALUES (37, '王一耳', '化学工程与工艺', '大一', '女');
INSERT INTO `studentmessage` VALUES (38, '王千亿', '电子信息工程', '大三', '男');
INSERT INTO `studentmessage` VALUES (39, '杨万里', '电子信息工程', '大二', '男');
INSERT INTO `studentmessage` VALUES (40, '杨千里', '电子信息工程', '大四', '男');
INSERT INTO `studentmessage` VALUES (41, '杨百里', '数学与应用数学', '大三', '男');
INSERT INTO `studentmessage` VALUES (42, '朱飞', '数学与应用数学', '大二', '男');
INSERT INTO `studentmessage` VALUES (43, '石岳延', '电子信息工程', '大三', '男');
INSERT INTO `studentmessage` VALUES (44, '熊子汭', '电子信息工程', '大二', '女');

SET FOREIGN_KEY_CHECKS = 1;
